In [1]:
import pandas as pd

## 2-1. 시리즈

- 시리즈 만들기

In [2]:
# key:value 쌍으로 딕셔너리를 만들고, 변수 dict_data에 저장
dict_data = {'a':1, 'b':2, 'c':3}

In [3]:
# 판다스 Series() 함수로 dictionary를 Series로 변환, 변수 sr에 저장
sr = pd.Series(dict_data)

In [4]:
print(type(sr))
print('\n')
print(sr)

<class 'pandas.core.series.Series'>


a    1
b    2
c    3
dtype: int64

- 인덱스 만들기

In [5]:
# 리스트를 시리즈로 변환하여 변수 sr에 저장
list_data = ['2019-01-02', 3.14, 'ABC',100, True]
sr = pd.Series(list_data)
sr

0    2019-01-02
1          3.14
2           ABC
3           100
4          True
dtype: object

In [6]:
# 인덱스 배열은 변수 idx에 저장, 데이터 값 배열은 변수 val에 저장
idx = sr.index
val = sr.values
print(idx)
print('\n')
print(val)

RangeIndex(start=0, stop=5, step=1)


['2019-01-02' 3.14 'ABC' 100 True]

- 원소 선택

In [7]:
# 튜플을 시리즈로 변환(인덱스 옵션 지정)
tup_data = ('영인','2010-05-01','여',True)
sr = pd.Series(tup_data, index = ['이름','생년월일','성별','학생여부'])
print(sr)

이름              영인
생년월일    2010-05-01
성별               여
학생여부          True
dtype: object

In [8]:
print(sr[0])
print(sr['이름'])

영인
영인

In [9]:
print(sr[[1,2]])
print('\n')
print(sr[['생년월일','성별']])

생년월일    2010-05-01
성별               여
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

In [11]:
print(sr[1:2]) # '성별' 불포함
print('\n')
print(sr['생년월일':'성별'])

생년월일    2010-05-01
dtype: object


생년월일    2010-05-01
성별               여
dtype: object

## 2-2. 데이터프레임

- 데이터프레임 만들기

In [12]:
# 열이름 key로 하고, 리스트를 value로 갖는 딕셔너리 정의(2차원 배열)
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2':[7,8,9],'c3':[10,11,12],'c4':[13,14,15]}

In [13]:
# 판다스 DataFrame() 함수로 딕셔너리를 데이터프레임으로 변환, 변수 df에 저장
df = pd.DataFrame(dict_data)

In [14]:
print(type(df))
print('\n')
print(df)

<class 'pandas.core.frame.DataFrame'>


   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

- 행 인덱스/열 이름 설정

In [15]:
# 행 인덱스/열 이름 지정하여 데이터프레임 만들기
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index = ['준서','예은'],
                 columns = ['나이','성별','학교'])

In [16]:
# 행 인덱스, 열 이름 확인하기
print(df)
print('\n')
print(df.index)
print('\n')
print(df.columns)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중


Index(['준서', '예은'], dtype='object')


Index(['나이', '성별', '학교'], dtype='object')

In [17]:
df.index = ['학생1','학생2']
df.columns = ['연령','남녀','소속']

In [18]:
print(df)
print('\n')
print(df.index)
print('\n')
print(df.columns)

     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중


Index(['학생1', '학생2'], dtype='object')


Index(['연령', '남녀', '소속'], dtype='object')

In [20]:
df = pd.DataFrame([[15,'남','덕영중'],[17,'여','수리중']],
                 index = ['준서','예은'],
                 columns = ['나이','성별','학교'])
print(df)
print('\n')

# 열 이름 중, '나이'를 '연령'으로, '성별'을 '남녀'로, '학교'를 '소속'으로 바꾸기
df.rename(columns = {'나이':'연령', '성별':'남녀', '학교':'소속'},inplace = True)

# df의 행 인덱스 중에서, '준서'를 '학생1'로, '예은'을 '학생2'로 바꾸기
df.rename(index = {'준서':'학생1', '예은':'학생2'}, inplace = True)

print(df)

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중


     연령 남녀   소속
학생1  15  남  덕영중
학생2  17  여  수리중

- 행/열 삭제

In [21]:
# DataFrame() 함수로 데이터프레임 변환, 변수 df에 저장
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,100]}

df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100  100

In [22]:
# 데이터프레임 df를 복제하여 변수 df2에 저장, df2의 1개 행(row) 삭제
df2 = df[:]
df2.drop('우현', inplace = True)
df2

C:\Users\khb16\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  영어   음악   체육
서준  90  98   85  100
인아  70  95  100  100

In [23]:
# 데이터프레임 df를 복제하여 변수 df3에 저장, df3의 2개 행(row) 삭제
df3 = df[:]
df3.drop(['우현','인아'], axis=0, inplace = True)
df3

C:\Users\khb16\anaconda3\lib\site-packages\pandas\core\frame.py:4906: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

    수학  영어  음악   체육
서준  90  98  85  100

In [24]:
# 데이터프레임 df를 복제하여 변수 df4에 저장, df4의 1개 행(row) 삭제
df4 = df.copy()
df4.drop('수학', axis=1, inplace = True)
df4

    영어   음악   체육
서준  98   85  100
우현  89   95   90
인아  95  100  100

In [25]:
# 데이터프레임 df를 복제하여 변수 df5에 저장, df5의 2개 행(row) 삭제
df5 = df.copy()
df5.drop(['영어','음악'], axis=1, inplace = True)
df5

    수학   체육
서준  90  100
우현  80   90
인아  70  100

- 행 선택

In [26]:
exam_data = {'수학':[90,80,70], '영어':[98,89,95],
            '음악':[85,95,100], '체육':[100,90,100]}

df = pd.DataFrame(exam_data, index = ['서준','우현','인아'])
df

    수학  영어   음악   체육
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100  100

In [27]:
# 행 인덱스를 사용하여 행 1개 선택
label1 = df.loc['서준']
position1 = df.iloc[0]
print(label1)
print('\n')
print(position1)

수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64


수학     90
영어     98
음악     85
체육    100
Name: 서준, dtype: int64

In [28]:
# 행 인덱스를 사용하여 2개 이상의 행 선택
label2 = df.loc[['서준','우현']]
position2 = df.iloc[[0,1]]
print(label2)
print('\n')
print(position2)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90

In [29]:
# 행 인덱스의 범위를 지정하여 행 선택
label3 = df.loc['서준':'우현'] # '우현' 포함
position3 = df.iloc[0:1] # '우현' 제외
print(label3)
print('\n')
print(position3)

    수학  영어  음악   체육
서준  90  98  85  100
우현  80  89  95   90


    수학  영어  음악   체육
서준  90  98  85  100

- 열 선택

In [30]:
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70], 
             '영어':[98,89,95],
            '음악':[85,95,100], 
             '체육':[100,90,100]}

df = pd.DataFrame(exam_data)
print(df)
print('\n')
print(type(df))

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100


<class 'pandas.core.frame.DataFrame'>

In [31]:
# '수학' 점수 데이터만 선택, 변수 math1에 저장
math1 = df['수학']
print(math1)
print(type(math1))

0    90
1    80
2    70
Name: 수학, dtype: int64
<class 'pandas.core.series.Series'>

In [32]:
# '영어' 점수 데이터만 선택, 변수 english에 저장
english = df['영어'] # 시리즈 반환
print(english)
print(type(english))

0    98
1    89
2    95
Name: 영어, dtype: int64
<class 'pandas.core.series.Series'>

In [33]:
# '음악','체육' 점수 데이터를 선택, 변수 music_gym에 저장
music_gym = df[['음악','체육']]
print(music_gym)
print(type(music_gym))

    음악   체육
0   85  100
1   95   90
2  100  100
<class 'pandas.core.frame.DataFrame'>

In [34]:
# '수학' 점수 데이터만 선택, 변수 math2에 저장
math2 = df[['수학']] # 데이터프레임 반환
print(math2)
print(type(math2))

   수학
0  90
1  80
2  70
<class 'pandas.core.frame.DataFrame'>

- 원소 선택

In [35]:
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100

In [36]:
# '이름' 열을 새로운 인덱스로 지정하고, df 객체에 변경 사항 반영
df.set_index('이름', inplace = True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100  100

In [37]:
# 데이터프레임 df의 특정 원소 1개 선택('서준'의 '음악' 점수)
a = df.loc['서준','음악']
a

85

In [38]:
b = df.iloc[0,2]
b

85

In [39]:
# 데이터프레임 df의 특정 원소 2개 이상 선택('서준'의 '음악', '체육' 점수)
c = df.loc['서준',['음악','체육']]
c

음악     85
체육    100
Name: 서준, dtype: int64

In [40]:
d = df.iloc[0,[2,3]]
d

음악     85
체육    100
Name: 서준, dtype: int64

In [41]:
e = df.loc['서준','음악':'체육']
e

음악     85
체육    100
Name: 서준, dtype: int64

In [42]:
f = df.iloc[0, 2:]
f

음악     85
체육    100
Name: 서준, dtype: int64

In [43]:
# df 2개 이상의 행과 열에 속하는 원소들 선택('서준', '우현'의 '음악','체육' 점수)
g = df.loc[['서준','우현'],['음악','체육']]
g

    음악   체육
이름
서준  85  100
우현  95   90

In [44]:
h = df.iloc[[0,1],[2,3]]
h

    음악   체육
이름
서준  85  100
우현  95   90

In [45]:
i = df.loc['서준':'우현','음악':'체육']
i

    음악   체육
이름
서준  85  100
우현  95   90

In [46]:
j = df.iloc[0:2, 2:]
j

    음악   체육
이름
서준  85  100
우현  95   90

- 열 추가

In [48]:
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70], 
             '영어':[98,89,95],
            '음악':[85,95,100], 
             '체육':[100,90,100]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100

In [49]:
# 새로운 행(row) 추가 - 같은 원소 값 입력
df.loc[3] = 0
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100
3   0   0   0    0    0

In [50]:
# 새로운 행(row) 추가 - 원소 값 여러 개의 배열 입력
df.loc[4] = ['동규',90,80,70,60]
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100
3   0   0   0    0    0
4  동규  90  80   70   60

In [51]:
# 새로운 행(row) 추가 - 기존 행 복사
df.loc['행5'] = df.loc[3]
df

    이름  수학  영어   음악   체육
0   서준  90  98   85  100
1   우현  80  89   95   90
2   인아  70  95  100  100
3    0   0   0    0    0
4   동규  90  80   70   60
행5   0   0   0    0    0

- 원소 값 변경

In [53]:
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70], 
             '영어':[98,89,95],
            '음악':[85,95,100], 
             '체육':[100,90,100]}

df = pd.DataFrame(exam_data)

df.set_index('이름', inplace = True)
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100  100

In [54]:
# 데이터프레임 df의 특정 원소를 변경하는 방법: '서준'의 '체육' 점수
df.iloc[0][3] = 80
df

    수학  영어   음악   체육
이름
서준  90  98   85   80
우현  80  89   95   90
인아  70  95  100  100

In [55]:
df.loc['서준']['체육'] = 90
df

    수학  영어   음악   체육
이름
서준  90  98   85   90
우현  80  89   95   90
인아  70  95  100  100

In [56]:
df.loc['서준','체육'] = 100
df

    수학  영어   음악   체육
이름
서준  90  98   85  100
우현  80  89   95   90
인아  70  95  100  100

In [58]:
# 데이터프레임 df의 원소 여러 개를 변경하는 방법 : '서준'의 '음악', '체육' 점수
df.loc['서준',['음악','체육']] = 50
df

    수학  영어   음악   체육
이름
서준  90  98   50   50
우현  80  89   95   90
인아  70  95  100  100

In [59]:
df.loc['서준',['음악','체육']] = 100, 50
df

    수학  영어   음악   체육
이름
서준  90  98  100   50
우현  80  89   95   90
인아  70  95  100  100

- 행, 열의 위치 바꾸기

In [60]:
exam_data = {'이름':['서준','우현','인아'],
             '수학':[90,80,70], 
             '영어':[98,89,95],
            '음악':[85,95,100], 
             '체육':[100,90,100]}

df = pd.DataFrame(exam_data)
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100

In [61]:
df = df.transpose()
df

      0   1    2
이름   서준  우현   인아
수학   90  80   70
영어   98  89   95
음악   85  95  100
체육  100  90  100

In [62]:
df = df.T
df

   이름  수학  영어   음악   체육
0  서준  90  98   85  100
1  우현  80  89   95   90
2  인아  70  95  100  100